#### BuiltInFailures.SteelElementFailures Members

---

|  |
| --- |
| BuiltInFailures SteelElementFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SteelElementFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | SteelElementModifyParametersTaskNotFinished | Cannot modify parameters while background calculations are in progress. |
| Public property Static member | SteelElementModifyRangesTaskNotFinished | Cannot modify ranges while background calculations are in progress. |
| Public property Static member | SteelElementPreviewTaskNotFinished | Cannot create preview while background calculations are in progress. |
| Public property Static member | SteelElementPropagationTaskNotFinished | Advance Steel propagation tasks not finished. |
| Public property Static member | SteelElementTaskNotFinished | Advance Steel tasks not finished. |

# See Also

BuiltInFailures SteelElementFailures Class

Autodesk.Revit.DB Namespace